<a href="https://colab.research.google.com/github/Shikhas/Data-Preparation-and-Analysis/blob/master/Analyze_Occupation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

In [7]:
users = pd.read_csv(url, sep='|', index_col = "user_id")
users.head(5) # first 5

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [8]:
users.tail(5) # last 5 entries

         age gender     occupation zip_code
user_id
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [10]:
users.shape # number of rows and columns

(943, 4)

In [11]:
users.shape[0] # number of rows

943

In [12]:
users.shape[1] # number of columns

4

In [13]:
users.index. # how the data is indexed

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [14]:
users.dtypes # data types of columns

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [16]:
users.occupation # print only occupation column

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [17]:
users["occupation"] # print only occupation column

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [18]:
users.occupation.value_counts().count() # number of differnt types of occupation

21

In [20]:
most_popular_occupation = users.occupation.value_counts().sort_values(ascending = False) # most popular or frequent occupation

In [25]:
most_popular_occupation.head(1)

student    196
Name: occupation, dtype: int64

In [26]:
users.occupation.value_counts().head(1).index[0] # most popular or frequent occupation

'student'

In [29]:
users.occupation.value_counts().head() # top 5

student          196
other            105
educator          95
administrator     79
engineer          67
Name: occupation, dtype: int64

In [31]:
users.describe() # summarize dataframe

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [32]:
users.describe(include = "all") # describe all columns, by default only numeric ones are returned

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [33]:
users.occupation.describe() # summarize only occupation

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [35]:
round(users.age.mean()) # mean age of users

34

In [40]:
users.age.value_counts().sort_values(ascending = True).index[0] # least frequent age of users

7

In [43]:
users.age.value_counts().tail()

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64